var parisen = 'パリは世界屈指の観光都市である芸術の都」などのイメージを前面に出す戦略をとっている。おもな集客装置は、歴史的な建造物の数々（世界遺産「パリのセーヌ河岸」に入っている建物など）、数々の美術館に収められた著名な美術品、有名料理店で提供されるフランス料理、高級銘柄を扱う店舗などである。建造物は、中世以前のものも残るが、第三共和政期のパリ改造やベル・エポックの建造物、あるいはフランス革命200周年期のグラン・プロジェの建造物など、各時代の世界の最先端のものが多い。美術館には、フランスで活躍した著名な芸術家の美術品の他、戦利品や購買によって収集された世界一級の収蔵物が並ぶ。'


var ronsen = 'ロンドンには、ロンドン塔、キューガーデン、ウェストミンスター宮殿（聖マーガレット教会を含む）、グリニッジ（グリニッジ天文台跡をグリニッジ子午線が通る）の4つの世界文化遺産が存在する。他の有名なランドマークとしては、バッキンガム宮殿、ロンドン・アイ、ピカデリーサーカス、セント・ポール大聖堂、タワーブリッジ、トラファルガー広場、ウェンブリー・スタジアムがある。多数の博物館、美術館、図書館といった文化施設や、スポーツイベント、文化機関も存在する。大英博物館、ナショナル・ギャラリー、テート・モダン、大英図書館、ウィンブルドン選手権、40軒の劇場が軒を連ねるウェスト・エンド・シアターは代表的なものである'

var hokusen = '「北海道」はブランド総合研究所による「都道府県の魅力度ランキング」で2018年現在、10年連続で1位に選ばれる[1]など人気が高い観光地である。小樽、札幌、富良野、知床、釧路などの見所がある。'

var sebusen = 'スペイン統治の名残でキリスト教の教会、スペイン統治時代の要塞、港町らしい巨大市場、博物館などがある。サン・ペドロ要は塞海に面する砦で、スペイン統治時代の1738年、イスラムの海賊からの防御を目的に建造された。マニラのイントラムロスと並びフィリピン最古の要塞である。後のアメリカ統治時代には兵舎として、第2次世界大戦時には日本軍による捕虜収容所として使用された。'

var zyasen = 'モナスという独立記念塔はガンビル駅に隣接する独立記念広場の中心にある高さ137メートルの塔である。国立中央博物館は独立記念広場に隣接しておりジャワ原人の頭蓋骨を展示（ただしレプリカ）。交易時代、日本からもたらされた陶磁器なども展示されている。イスティクラルは国立モスクで世界で第３位であり、また東南アジアで最大規模のイスラム教礼拝堂である。'

var amusen = 'オランダの首都である。アムステルダム国立美術館、ゴッホ美術館、アンネ・フランクの家、レンブラントの家、オランダ東インド会社跡などがある'

var cairosen = '新市街から東には旧市街（イスラーム地区）が広がる。この地区はファーティマ朝時代に建設された本来のカイロにあたる地域である。旧市街北部にはアズハル・モスクと、988年に創立されたイスラム世界最古の大学であるアズハル大学がある。アズハル大学の隣には1382年に宿場が作られて以来大規模なスークとなっているハーン・アル＝ハリーリーがあり、現在では土産物屋が軒を連ね、観光名所となっている'

var sourusen = '韓国の首都である。景福宮、光化門徳寿宮昌徳宮（世界遺産）、昌慶宮清渓川宗廟（世界遺産）、崇礼門（南大門）、興仁之門（東大門）、南山公園などの見所がある。'

var tyusen = 'ほとんどのチューリッヒの名所はリマト川沿いとチューリッヒ中央駅とチューリッヒ湖の間に位置している。旧市街の教会や家屋はこの地域に集まっており、ほとんどの高級店は有名なバーンホフ通り沿いに林立している。旧市街にあるリンデンホーフ（英語版）はローマ帝国時代の城で歴史的な場所であり、その後はカロリングの居城であった。'

var newsen = 'ニューヨークには、毎年4700万人の外国人・アメリカ人が訪れ、観光の重要性は高い。有名な観光名所としては、エンパイア・ステート・ビルディング、ウォルドルフ＝アストリア、エリス島、ブロードウェイ劇場、メトロポリタン美術館を始めとする博物館・美術館などがあり、そのほかにもセントラル・パーク、ワシントン・スクエア・パーク、ロックフェラー・センター、タイムズスクエア、リトル・イタリー、チャイナタウン、ブルックリン橋など、観光客を引きつけるものは数多い。自由の女神像は、有名な観光スポットである。'

var hanoisen = '水上人形劇…元は農閑期の農民の娯楽が芸術にまで昇華したもの。伝統音楽に合わせ、多くの人形達が水上で劇を披露する。旧市街は11世紀、ハノイに都が置かれて以来栄え続けた、ホアンキエム湖北側の地域。細い路地が入り組み、古い街並みが続く通りでハノイ36通り」と親しみを込めて呼ばれホアンキエム湖（還剣湖は市の中心に位置する湖。公園として整備され、市民の憩いの場となっている。湖の真ん中には玉山祠がある'

var bansen = '交通の要所である上に観光資源が豊富なこともあり、東南アジア観光の中心地である。マスターカードが2016年に公表した統計によると、「世界で最も外国人が訪れる都市」と算定された。また、アメリカの旅行雑誌『トラベル+レジャー』によって、2010年から4年連続で世界一の観光都市と評価されている。寺院や歴史的建造物が多数存在する他、物価も比較的安いことから、カオサン通りなどバックパッカーが集まる一帯もある。他にも、中心部にある「パッポン通り」や「ソイ・カウボーイ」などはバーやクラブが立ち並ぶなどナイトライフが活気を見せている。'

var honosen = 'アメリカ国内や日本をはじめとする世界各国から観光客が訪れるハワイ諸島の中でも、ホノルルはその多くが足を踏み入れるハワイ諸島における一大観光拠点であり、様々な観光地やホテルが点在している。モアナ・サーフライダー・ウェスティン・リゾート&スパ、ダイヤモンドヘッド（Diamond Head）、アリゾナ記念館（USS Arizona Memorial）、ワイキキビーチ、国立太平洋記念墓地、ビショップ博物館、アラモアナ・ショッピングセンター、アロハタワー（Aloha Tower）などの見所がある'

var bersen = 'ベルリンは世界有数のコンベンション都市でもあり、欧州でも大きなコンベンションセンターとしてメッセ・ベルリンがある。そこではオーディオ・ビジュアルや家電関連の国際コンシューマ・エレクトロニクス展（IFA）や園芸関連のベルリン国際グリーンウィーク（英語版）、世界最大の国際鉄道技術見本市イノトランス、国際的な旅行の見本市であるベルリン国際観光フェア（ドイツ語版）（ITB）など、各種見本市が開催され、多くのビジネス客が訪れる。'

var shansen = '中国の中でも人気が高い観光地のひとつである、上海。その魅力は、宋や明時代から続く寺院や、租界時代を思わせる歴史的建造物を間近に見ることができるだけではなく、リノベーションされた最新の複合施設や、きらめく夜景を独り占めできる絶景スポットなど、大人がじっくりと満喫できる場所がたくさんある街である。'

var pekinsen = '中国の代表的な観光都市として知られ、50万年前からの人類が生活してきた歴史、3000余年の街造りの歴史、700余年も全国的な政権が都をこの地に置いた歴史があり、中国の七大古都の1つである。北京は古都にふさわしい第一級の名勝史跡に恵まれており、外国人観光客数、観光外貨収入は国内第1位である。紫禁城や天安門広場、庭園、古くから市民の居住する街並みである衚衕などがあり海外からの観光客も多く訪れる都市である。北京と瀋陽の明・清王朝皇宮、万里の長城、周口店の北京原人遺跡などの世界遺産が見所である'

var kyotosen = '市内に観光地が散在し、2000年以降は年間4〜5千万人台の観光客が訪れる。2017年（平成29年）の観光客数は5,362万人だった。また、同年の外国人宿泊者数は353万人であり、近年は英米の旅行情報誌などで旅行先としての認知が進む[84][85]。国際会議の開催も日本国内では東京に次いで多く[86]、国際会議観光都市に指定されている。古くは京都が日本の政治・文化の中心となっていて、第二次世界大戦の戦災から免れたことから、国宝の約20%、重要文化財の約14%が京都市内に存在する。1994年（平成6年）に、近隣の宇治市内と滋賀県大津市内に所在するものを含め、17件の文化財が世界遺産に登録された'

var okisen = '本県の主な産業として、伝統・歴史・自然・食・国際色を生かした観光業が挙げられる。ただし、これらの観光業は景気に左右されやすい。 沖縄本島のリゾートホテル付設や公営の海水浴場の多くは、ワイキキビーチと同様に人工海浜であり、観光資源ではあるが「沖縄の自然」ではない。観光客数は国内外合わせて5,690,000人（国内：5,443,800人、海外：246,200人）である。米国からの観光客は、米軍基地関係者が多く含まれる。2000年（平成12年）に主要国首脳会議が行われたのをきっかけに、国際会議、コンベンションといったイベント開催地としての体勢作りを進めている。また県はスポーツアイランド構想を掲げエコツーリズムも活発化している。'

var tekisen = 'アメリカ南部に位置するテキサス州は日本人にとってあまりメジャーな旅行先ではありませんが、カウボーイ、ロデオ、西部劇などのイメージは浮かぶ。テキサスは州の面積が日本の国土より広いのですが、テキサス最大の牧場はなんとロードアイランド州より広い！ステーキもデカい！かつてメキシコから独立し、10年間独立国のテキサス共和国だったテキサスに住むテキサス人は、愛国心より愛州心が強いとされています。そんなユニークなテキサスには興味をそそる、おすすめ観光都市、スポットが沢山あります。'

var tokyosen = '日本の首都。日本最強の都市にして、観光でも圧倒的な強さを誇る。東京スカイツリー、浅草、渋谷、ディズニーランド、東京タワーなどの見所がある。夜景も見事である。'


const parikeyword = {'focus': 'LOC', 'keywords': [{'パリ': 7.243}, {'フランス料理': 0.7857}, {'建造物': 0.3667}, {'美術品': 0.2538}, {'有名料理店': 0.1571}], 'request_id': 'record001'}

const lonkeyword = {'focus': 'LOC', 'keywords': [{'ロンドン': 5.4545}, {'美術館': 0.22}, {'図書館': 0.22}, {'博物館': 0.22}, {'スポーツイベント': 0.22}], 'request_id': 'record001'}

const hokukeyword = {'focus': 'LOC', 'keywords': [{'北海道': 6.6124}, {'ブランド総合研究所': 0.3474}, {'魅力度ランキング': 0.2316}, {'観光地': 0.2316}, {'小樽': 0.2105}], 'request_id': 'record001'}

const sebukeyword = {'focus': 'LOC', 'keywords': [{'セブ': 5.4545}, {'スペイン': 1.4762}, {'マニラ': 0.619}, {'フィリピン': 0.619}, {'スペイン統治時代': 0.4482}], 'request_id': 'record001'}

const zyakeyword = {'focus': 'LOC', 'keywords': [{'ジャカルタ': 5.4545}, {'ガンビル駅': 1.55}, {'日本': 0.65}, {'モナス': 0.465}, {'独立記念広場': 0.465}], 'request_id': 'record001'}

const amukeyword = {'focus': 'LOC', 'keywords': [{'アムステルダム': 5.4545}, {'オランダ': 1.4667}, {'アムステルダム国立美術館': 0.08}, {'レンブラント': 0.08}, {'ゴッホ美術館': 0.0533}], 'request_id': 'record001'}
const cairokeyword = {'focus': 'LOC', 'keywords': [{'カイロ': 6.4111}, {'新市街': 1.3478}, {'イスラーム': 1.3478}, {'アズハル大学': 0.2629}, {'ファーティマ朝時代': 0.1913}], 'request_id': 'record001'}

const soulkeyword = {'focus': 'LOC', 'keywords': [{'ソウル': 5.4545}, {'韓国': 1.2222}, {'東大門': 0.2222}, {'昌慶宮清渓川宗廟': 0.2222}, {'南大門': 0.2222}], 'request_id': 'record001'}

const tyukeyword = {'focus': 'LOC', 'keywords': [{'チューリッヒ': 7.1016}, {'チューリッヒ湖': 1.6471}, {'リマト': 1.6471}, {'チューリッヒ中央駅': 1.6471}, {'バーンホフ通り沿い': 0.1882}], 'request_id': 'record001'}

const newkeyword = {'focus': 'LOC', 'keywords': [{'ニューヨーク': 6.4545}, {'エリス島': 0.5714}, {'タイムズスクエア': 0.5714}, {'ブロードウェイ劇場': 0.5714}, {'ワシントン・スクエア・パーク': 0.5714}], 'request_id': 'record001'}

const hanoikeyword = {'focus': 'LOC', 'keywords': [{'ハノイ': 6.6768}, {'ハノイ36通り': 0.8889}, {'ホアンキエム湖': 0.8889}, {'還剣湖': 0.8889}, {'水上人形劇': 0.3778}], 'request_id': 'record001'}

const bankeyword = {'focus': 'LOC', 'keywords': [{'バンコク': 5.4545}, {'東南アジア': 1.4261}, {'アメリカ': 0.8}, {'カオサン通り': 0.487}, {'観光資源': 0.2852}], 'request_id': 'record001'}

const hawaikeyword = {'focus': 'LOC', 'keywords': [{'ホノルル': 6.2132}, {'ハワイ諸島': 1.2336}, {'アメリカ': 0.7586}, {'日本': 0.7586}, {'一大観光拠点': 0.1517}], 'request_id': 'record001'}

const berukeyword = {'focus': 'LOC', 'keywords': [{'ベルリン': 6.8015}, {'欧州': 0.8462}, {'メッセ': 0.1692}, {'コンベンションセンター': 0.1692}, {'コンベンション': 0.1692}], 'request_id': 'record001'}

const syankeyword = {'focus': 'LOC', 'keywords': [{'上海': 6.7487}, {'中国': 1.2941}, {'観光地': 0.2588}, {'宋': 0.2353}, {'建造物': 0.0471}], 'request_id': 'record001'}

const pekinkeyword = {'focus': 'LOC', 'keywords': [{'北京': 6.8893}, {'中国': 2.0217}, {'紫禁城': 0.5417}, {'天安門広場': 0.5417}, {'外国人観光客数': 0.1833}], 'request_id': 'record001'}

const kyoukeyword = {'focus': 'LOC', 'keywords': [{'京都': 5.8392}, {'日本': 0.9796}, {'東京': 0.6154}, {'観光客': 0.4163}, {'京都市内': 0.3846}], 'request_id': 'record001'}

const okikeyword = {'focus': 'LOC', 'keywords': [{'沖縄': 6.3018}, {'ワイキキビーチ': 0.8473}, {'米国': 0.4926}, {'観光業': 0.3909}, {'伝統・歴史・自然・食・国際色': 0.3606}], 'request_id': 'record001'}

const tekikeyword = {'focus': 'LOC', 'keywords': [{'テキサス': 6.9429}, {'テキサス州': 1.2174}, {'テキサス共和国': 0.6957}, {'テキサス人': 0.6957}, {'ロードアイランド州': 0.6957}], 'request_id': 'record001'}

const tokyokeyword = {'focus': 'LOC', 'keywords': [{'東京': 5.4545}, {'日本': 2.5135}, {'渋谷': 0.7222}, {'浅草': 0.7222}, {'ディズニーランド': 0.7222}], 'request_id': 'record001'}

var returnSentence = function(city) {
    
    if (city == 'パリ') {
        return parisen
    }
    else if (city == 'ロンドン') {
        return ronsen
    }
    else if (city == '東京') {
        return tokyosen
    }else if (city == '沖縄') {
        return okisen
    }else if (city == '京都') {
        return kyotosen
    }else if (city == 'チューリッヒ') {
        return tyusen
    }else if (city == 'セブ') {
        return sebusen
    }else if (city == 'バンコク') {
        return bansen
    }else if (city == 'ホノルル') {
        return honosen
    }else if (city == 'テキサス') {
        return tekisen
    }else if (city == 'ニューヨーク') {
        return newsen
    }else if (city == '北京') {
        return pekinsen
    }else if (city == '上海') {
        return shansen
    }else if (city == 'ジャカルタ') {
        return zyasen
    }else if (city == 'エジプト') {
        return cairosen
    }else if (city == 'ソウル') {
        return sourusen
    }else if (city == 'アムステルダム') {
        return amusen
    }else if (city == '北海道') {
        return hokusen
    }else if (city == 'ベルリン') {
        return bersen
    }else if (city == 'ハノイ') {
        return hanoisen
    }
    else {
        return ''
    }

};

var returnKeyword = function(city) {
    
    if (city == 'パリ') {
        return parikeyword
    }
    else if (city == 'ロンドン') {
        return lonkeyword
    }
    else if (city == '東京') {
        return tokyokeyword
    }else if (city == '沖縄') {
        return okikeyword
    }else if (city == '京都') {
        return kyoukeyword
    }else if (city == 'チューリッヒ') {
        return tyukeyword
    }else if (city == 'セブ') {
        return sebukeyword
    }else if (city == 'バンコク') {
        return bankeyword
    }else if (city == 'ホノルル') {
        return  hawaikeyword
    }else if (city == 'テキサス') {
        return tekikeyword
    }else if (city == 'ニューヨーク') {
        return newkeyword
    }else if (city == '北京') {
        return pekinkeyword
    }else if (city == '上海') {
        return syankeyword
    }else if (city == 'ジャカルタ') {
        return zyakeyword
    }else if (city == 'エジプト') {
        return cairokeyword
    }else if (city == 'ソウル') {
        return soulkeyword
    }else if (city == 'アムステルダム') {
        return amukeyword
    }else if (city == '北海道') {
        return hokukeyword
    }else if (city == 'ベルリン') {
        return berukeyword
    }
    else if (city == 'ハノイ') {
        return hanoikeyword
    }
    else {
        return parikeyword
    }

};


var makeComment = function(data) {

    const usrsen = [
    ["手軽さが好きで","冒険心のある"],
    ["賑やかな場所が好きで","落ち着いた場所が好きな"],
    ["半袖が好きで","コートが似合う"],
    ["教養深く","動物や植物が好きな"],
    ["アジアに興味があり","洋風好みな"]
    ]
    const citysen = [
    ["近場で","遠く離れた"],
    ["活気に溢れ","のどかな風景に囲まれた"],
    ["太陽が眩しく","寒さに試される"],
    ["歴史に溢れ","大自然に囲まれた"],
    ["エスニックな雰囲気のある","欧米的な雰囲気の"]
    ]
    var array = []

    for (var i = 0;i < data.length; i++) {
        b = [data[i]]
        b.push(i)
        array.push(b)
    }

    array.sort()
    str = usrsen[array[4][1]][0]+usrsen[array[0][1]][1]+"あなたには、"+citysen[array[4][1]][0]+citysen[array[0][1]][1]+"これらの都市がおすすめです。"
    return str

}
